load-test.yml
config:
  target: "https://preview--tupa-hub-connect.lovable.app"
  phases:
    # Warm-up phase: 10 seconds con 10 req/s
    - duration: 10
      arrivalRate: 10
      name: "Warm-up"
    # Ramp-up phase: 20 seconds aumentando a 50 req/s
    - duration: 20
      arrivalRate: 50
      rampTo: 50
      name: "Ramp-up"
    # Sustained load: 60 seconds con 50 req/s constantes
    - duration: 60
      arrivalRate: 50
      name: "Sustained Load"
    # Cool-down phase: 10 seconds bajando a 10 req/s
    - duration: 10
      arrivalRate: 10
      name: "Cool-down"
  defaults:
    headers:
      Content-Type: "application/json"
      User-Agent: "Artillery-LoadTest/1.0"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Token Refresh Stress Test"
    weight: 100
    flow:
      # Simular refresh token endpoint
      - post:
          url: "/functions/v1/refresh-token-test"
            headers:
              Authorization: "Bearer {{ $randomString() }}"
              apikey: "<SUPABASE_KEY>"
          json:
            refresh_token: "mock_refresh_token_{{ $randomString() }}"
            user_id: "{{ $randomString() }}"
            session_id: "{{ $randomString() }}"
          capture:
            - json: "$.access_token"
              as: "new_token"
            - json: "$.expires_in"
              as: "token_expiry"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "access_token"

  - name: "Health Check Baseline"
    weight: 20
    flow:
      - get:
          url: "/functions/v1/notify-team"
            headers:
              apikey: "<SUPABASE_KEY>"
          expect:
            - statusCode: [200, 405] # GET might not be allowed on this endpoint